In [46]:
# a)	Display the first 5 records of the dataframe

import pandas as pd
import numpy as np

dsSalaries = pd.read_csv('data/ds_salaries.csv')
dsSalaries.head(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [47]:
# b)	What is the number of unique values under each category?

dsSalaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [48]:
# c)	How many of these employees have residence in Canada?

fltr = dsSalaries['employee_residence'] == 'CA'
dsSalaries['employee_residence'].where(fltr).value_counts()

employee_residence
CA    85
Name: count, dtype: int64

In [49]:
# d)	Create a dataframe of just Canadian residence called canDF

canDF = dsSalaries[dsSalaries['employee_residence'] == 'CA']
canDF

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
7,2023,SE,FT,Data Scientist,219000,USD,219000,CA,0,CA,M
8,2023,SE,FT,Data Scientist,141000,USD,141000,CA,0,CA,M
29,2023,SE,FT,Data Strategist,90000,USD,90000,CA,0,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3604,2021,SE,FT,Data Scientist,130000,CAD,103691,CA,100,CA,L
3608,2021,MI,FT,Research Scientist,80000,CAD,63810,CA,100,CA,M
3645,2021,SE,FT,Data Analyst,90000,CAD,71786,CA,100,CA,M
3653,2021,SE,FT,Research Scientist,120500,CAD,96113,CA,50,CA,L
3714,2021,SE,FT,Data Scientist,110000,CAD,87738,CA,100,CA,S

In [50]:
# e)	What is the min, max, and average salary for your canDF?

# min
canDF['salary_in_usd'].min()

10000

In [51]:
canDF['salary_in_usd'].max() # max

275000

In [52]:
canDF['salary_in_usd'].mean() # average

132222.90588235293

In [53]:
# f)	Display the record of the highest paid employee in canDF

canDF[canDF['salary_in_usd'] == canDF['salary_in_usd'].max()]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
323,2022,SE,FT,AI Developer,275000,USD,275000,CA,0,CA,S